# Getting started with pandas

In [1]:
from pandas import Series, DataFrame
import pandas as pd

In [2]:
from __future__ import division
from numpy.random import randn
import numpy as np
import os
import matplotlib.pyplot as plt
np.random.seed(12345)
plt.rc('figure', figsize=(10, 6))
from pandas import Series, DataFrame
import pandas as pd
np.set_printoptions(precision=4)

//anaconda/lib/python3.5/site-packages/matplotlib/font_manager.py:273: UserWarning: Matplotlib is building the font cache using fc-list. This may take a moment.
  warnings.warn('Matplotlib is building the font cache using fc-list. This may take a moment.')
//anaconda/lib/python3.5/site-packages/matplotlib/font_manager.py:273: UserWarning: Matplotlib is building the font cache using fc-list. This may take a moment.
  warnings.warn('Matplotlib is building the font cache using fc-list. This may take a moment.')

In [3]:
%pwd

'/Users/1001235/MyDev/ws_study/pydata-book'

In [ ]:
%cd ../book_scripts

## Introduction to pandas data structures

### Series

In [ ]:
obj = Series([4, 7, -5, 3])
obj

In [10]:
obj.values
obj.index

In [ ]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

In [ ]:
obj2.index

In [ ]:
obj2['a']

In [ ]:
obj2['d'] = 6
obj2[['c', 'a', 'd']]

In [ ]:
obj2[obj2 > 0]

In [ ]:
obj2 * 2

In [ ]:
np.exp(obj2)

In [ ]:
'b' in obj2

In [ ]:
'e' in obj2

In [ ]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = Series(sdata)
obj3

In [ ]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index=states)
obj4

In [ ]:
pd.isnull(obj4)

In [ ]:
pd.notnull(obj4)

In [ ]:
obj4.isnull()

In [ ]:
obj3

In [ ]:
obj4

In [ ]:
obj3 + obj4

In [ ]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

In [ ]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

### DataFrame

In [ ]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)

In [ ]:
frame

In [ ]:
DataFrame(data, columns=['year', 'state', 'pop'])

In [ ]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                   index=['one', 'two', 'three', 'four', 'five'])
frame2

In [ ]:
frame2.columns

In [ ]:
frame2['state']

In [ ]:
frame2.year

In [ ]:
frame2.ix['three']

In [ ]:
frame2['debt'] = 16.5
frame2

In [ ]:
frame2['debt'] = np.arange(5.)
frame2

In [ ]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

In [ ]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

In [ ]:
del frame2['eastern']
frame2.columns

In [ ]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [ ]:
frame3 = DataFrame(pop)
frame3

In [ ]:
frame3.T

In [ ]:
DataFrame(pop, index=[2001, 2002, 2003])

In [ ]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}
DataFrame(pdata)

In [ ]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

In [ ]:
frame3.values

In [ ]:
frame2.values

### Index objects

In [ ]:
obj = Series(range(3), index=['a', 'b', 'c'])
index = obj.index
index

In [ ]:
index[1:]

In [ ]:
index[1] = 'd'

In [ ]:
index = pd.Index(np.arange(3))
obj2 = Series([1.5, -2.5, 0], index=index)
obj2.index is index

In [ ]:
frame3

In [ ]:
'Ohio' in frame3.columns

In [ ]:
2003 in frame3.index

## Essential functionality

### Reindexing

In [ ]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

In [ ]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

In [ ]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

In [ ]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3.reindex(range(6), method='ffill')

In [ ]:
frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],
                  columns=['Ohio', 'Texas', 'California'])
frame

In [ ]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

In [ ]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

In [ ]:
frame.reindex(index=['a', 'b', 'c', 'd'], method='ffill',
              columns=states)

In [ ]:
frame.ix[['a', 'b', 'c', 'd'], states]

### Dropping entries from an axis

In [ ]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
new_obj = obj.drop('c')
new_obj

In [ ]:
obj.drop(['d', 'c'])

In [ ]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])

In [ ]:
data.drop(['Colorado', 'Ohio'])

In [ ]:
data.drop('two', axis=1)

In [ ]:
data.drop(['two', 'four'], axis=1)

### Indexing, selection, and filtering

In [ ]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj['b']

In [ ]:
obj[1]

In [ ]:
obj[2:4]

In [ ]:
obj[['b', 'a', 'd']]

In [ ]:
obj[[1, 3]]

In [ ]:
obj[obj < 2]

In [ ]:
obj['b':'c']

In [ ]:
obj['b':'c'] = 5
obj

In [ ]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
data

In [ ]:
data['two']

In [ ]:
data[['three', 'one']]

In [ ]:
data[:2]

In [ ]:
data[data['three'] > 5]

In [ ]:
data < 5

In [ ]:
data[data < 5] = 0

In [ ]:
data

In [ ]:
data.ix['Colorado', ['two', 'three']]

In [ ]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

In [ ]:
data.ix[2]

In [ ]:
data.ix[:'Utah', 'two']

In [ ]:
data.ix[data.three > 5, :3]

### Arithmetic and data alignment

In [4]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [5]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [6]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [7]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [8]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                index=['Ohio', 'Texas', 'Colorado'])
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df1

,b,c,d
Ohio,0.0,1.0,2.0
Texas,3.0,4.0,5.0
Colorado,6.0,7.0,8.0

In [10]:
df2

,b,d,e
Utah,0.0,1.0,2.0
Ohio,3.0,4.0,5.0
Texas,6.0,7.0,8.0
Oregon,9.0,10.0,11.0

In [9]:
list('abcde')

['a', 'b', 'c', 'd', 'e']

In [11]:
df1 + df2

,b,c,d,e
Colorado,NaN,NaN,NaN,NaN
Ohio,3.0,NaN,6.0,NaN
Oregon,NaN,NaN,NaN,NaN
Texas,9.0,NaN,12.0,NaN
Utah,NaN,NaN,NaN,NaN

#### Arithmetic methods with fill values

In [12]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))
df1

,a,b,c,d
0,0.0,1.0,2.0,3.0
1,4.0,5.0,6.0,7.0
2,8.0,9.0,10.0,11.0

In [13]:
df2

,a,b,c,d,e
0,0.0,1.0,2.0,3.0,4.0
1,5.0,6.0,7.0,8.0,9.0
2,10.0,11.0,12.0,13.0,14.0
3,15.0,16.0,17.0,18.0,19.0

In [14]:
df1 + df2

,a,b,c,d,e
0,0.0,2.0,4.0,6.0,NaN
1,9.0,11.0,13.0,15.0,NaN
2,18.0,20.0,22.0,24.0,NaN
3,NaN,NaN,NaN,NaN,NaN

In [15]:
df1.add(df2, fill_value=0)

,a,b,c,d,e
0,0.0,2.0,4.0,6.0,4.0
1,9.0,11.0,13.0,15.0,9.0
2,18.0,20.0,22.0,24.0,14.0
3,15.0,16.0,17.0,18.0,19.0

In [16]:
df1.reindex(columns=df2.columns, fill_value=0)

,a,b,c,d,e
0,0.0,1.0,2.0,3.0,0
1,4.0,5.0,6.0,7.0,0
2,8.0,9.0,10.0,11.0,0

#### Operations between DataFrame and Series

In [17]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [18]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [19]:
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [20]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.ix[0]
frame

,b,d,e
Utah,0.0,1.0,2.0
Ohio,3.0,4.0,5.0
Texas,6.0,7.0,8.0
Oregon,9.0,10.0,11.0

In [24]:
frame.ix

In [21]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [25]:
frame - series

,b,d,e
Utah,0.0,0.0,0.0
Ohio,3.0,3.0,3.0
Texas,6.0,6.0,6.0
Oregon,9.0,9.0,9.0

In [26]:
series2 = Series(range(3), index=['b', 'e', 'f'])
frame + series2

,b,d,e,f
Utah,0.0,NaN,3.0,NaN
Ohio,3.0,NaN,6.0,NaN
Texas,6.0,NaN,9.0,NaN
Oregon,9.0,NaN,12.0,NaN

In [27]:
series3 = frame['d']
frame

,b,d,e
Utah,0.0,1.0,2.0
Ohio,3.0,4.0,5.0
Texas,6.0,7.0,8.0
Oregon,9.0,10.0,11.0

In [28]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [29]:
frame.sub(series3, axis=0)

,b,d,e
Utah,-1.0,0.0,1.0
Ohio,-1.0,0.0,1.0
Texas,-1.0,0.0,1.0
Oregon,-1.0,0.0,1.0

In [34]:
series4 = frame.ix['Ohio']
series4

b    3.0
d    4.0
e    5.0
Name: Ohio, dtype: float64

In [35]:
frame.sub(series4, axis=1)

,b,d,e
Utah,-3.0,-3.0,-3.0
Ohio,0.0,0.0,0.0
Texas,3.0,3.0,3.0
Oregon,6.0,6.0,6.0

### Function application and mapping

In [37]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [38]:
frame

,b,d,e
Utah,0.274992,0.228913,1.352917
Ohio,0.886429,-2.001637,-0.371843
Texas,1.669025,-0.438570,-0.539741
Oregon,0.476985,3.248944,-1.021228

In [39]:
np.abs(frame)

,b,d,e
Utah,0.274992,0.228913,1.352917
Ohio,0.886429,2.001637,0.371843
Texas,1.669025,0.438570,0.539741
Oregon,0.476985,3.248944,1.021228

In [41]:
f = lambda x: x.max() - x.min()

In [43]:
frame.apply(f)

b    1.394034
d    5.250581
e    2.374144
dtype: float64

In [44]:
frame

,b,d,e
Utah,0.274992,0.228913,1.352917
Ohio,0.886429,-2.001637,-0.371843
Texas,1.669025,-0.438570,-0.539741
Oregon,0.476985,3.248944,-1.021228

In [45]:
frame.apply(f, axis=1)

Utah      1.124004
Ohio      2.888067
Texas     2.208767
Oregon    4.270171
dtype: float64

In [46]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

,b,d,e
min,0.274992,-2.001637,-1.021228
max,1.669025,3.248944,1.352917

In [47]:
format = lambda x: '%.2f' % x
frame.applymap(format)

,b,d,e
Utah,0.27,0.23,1.35
Ohio,0.89,-2.00,-0.37
Texas,1.67,-0.44,-0.54
Oregon,0.48,3.25,-1.02

In [ ]:
frame['e'].map(format)

### Sorting and ranking

In [4]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [5]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
                  columns=['d', 'a', 'b', 'c'])
frame.sort_index()

,d,a,b,c
one,4,5,6,7
three,0,1,2,3

In [6]:
frame.sort_index(axis=1)

,a,b,c,d
three,1,2,3,0
one,5,6,7,4

In [7]:
frame.sort_index(axis=1, ascending=False)

,d,c,b,a
three,0,3,2,1
one,4,7,6,5

In [16]:
obj = Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [15]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [10]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

,a,b
0,0,4
1,1,7
2,0,-3
3,1,2

In [14]:
frame.sort_values(by='b')

,a,b
2,0,-3
3,1,2
0,0,4
1,1,7

In [18]:
frame.sort_values(by=['a', 'b'])

,a,b
2,0,-3
0,0,4
3,1,2
1,1,7

In [21]:
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [22]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [23]:
obj.sort_values()

1   -5
5    0
4    2
3    4
6    4
0    7
2    7
dtype: int64

In [24]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [11]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [27]:
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [26]:
help(obj.rank)

Help on method rank in module pandas.core.generic:

rank(self, axis=0, method='average', numeric_only=None, na_option='keep', ascending=True, pct=False) method of pandas.core.series.Series instance
    Compute numerical data ranks (1 through n) along axis. Equal values are
    assigned a rank that is the average of the ranks of those values

    Parameters
    ----------
    axis: {0 or 'index', 1 or 'columns'}, default 0
        index to direct ranking
    method : {'average', 'min', 'max', 'first', 'dense'}
        * average: average rank of group
        * min: lowest rank in group
        * max: highest rank in group
        * first: ranks assigned in order they appear in the array
        * dense: like 'min', but rank always increases by 1 between groups
    numeric_only : boolean, default None
        Include only float, int, boolean data. Valid only for DataFrame or
        Panel objects
    na_option : {'keep', 'top', 'bottom'}
        * keep: leave NA values where they are
        * top: smallest rank if ascending
        * bottom: smallest rank if descending
    ascending : boolean, default True
        False for ranks by high (1) to low (N)
    pct : boolean, default False
        Computes percentage rank of data

    Returns
    -------
    ranks : same type as caller

In [28]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                   'c': [-2, 5, 8, -2.5]})
frame

,a,b,c
0,0,4.3,-2.0
1,1,7.0,5.0
2,0,-3.0,8.0
3,1,2.0,-2.5

In [29]:
frame.rank(axis=1)

,a,b,c
0,2.0,3.0,1.0
1,1.0,3.0,2.0
2,2.0,1.0,3.0
3,2.0,3.0,1.0

In [30]:
frame.rank()

,a,b,c
0,1.5,3.0,2.0
1,3.5,4.0,3.0
2,1.5,1.0,4.0
3,3.5,2.0,1.0

### Axis indexes with duplicate values

In [31]:
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [32]:
obj.index.is_unique

False

In [33]:
obj['a']

a    0
a    1
dtype: int64

In [34]:
obj['c']

4

In [35]:
df = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

,0,1,2
a,-0.204708,0.478943,-0.519439
a,-0.555730,1.965781,1.393406
b,0.092908,0.281746,0.769023
b,1.246435,1.007189,-1.296221

In [36]:
df.ix['b']

,0,1,2
b,0.092908,0.281746,0.769023
b,1.246435,1.007189,-1.296221

## Summarizing and computing descriptive statistics

In [37]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
                [np.nan, np.nan], [0.75, -1.3]],
               index=['a', 'b', 'c', 'd'],
               columns=['one', 'two'])
df

,one,two
a,1.40,NaN
b,7.10,-4.5
c,NaN,NaN
d,0.75,-1.3

In [38]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [39]:
df.sum(axis=1)

a    1.40
b    2.60
c     NaN
d   -0.55
dtype: float64

In [43]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [41]:
help(df.mean)

Help on method mean in module pandas.core.generic:

mean(self, axis=None, skipna=None, level=None, numeric_only=None, **kwargs) method of pandas.core.frame.DataFrame instance
    Return the mean of the values for the requested axis

    Parameters
    ----------
    axis : {index (0), columns (1)}
    skipna : boolean, default True
        Exclude NA/null values. If an entire row/column is NA, the result
        will be NA
    level : int or level name, default None
        If the axis is a MultiIndex (hierarchical), count along a
        particular level, collapsing into a Series
    numeric_only : boolean, default None
        Include only float, int, boolean data. If None, will attempt to use
        everything, then use only numeric data

    Returns
    -------
    mean : Series or DataFrame (if level specified)

In [44]:
df.idxmax()

one    b
two    d
dtype: object

In [46]:
df.cumsum(axis=1)

,one,two
a,1.40,NaN
b,7.10,2.60
c,NaN,NaN
d,0.75,-0.55

In [47]:
df.describe()

,one,two
count,3.000000,2.000000
mean,3.083333,-2.900000
std,3.493685,2.262742
min,0.750000,-4.500000
25%,1.075000,-3.700000
50%,1.400000,-2.900000
75%,4.250000,-2.100000
max,7.100000,-1.300000

In [51]:
df.var()

one    12.205833
two     5.120000
dtype: float64

In [50]:
obj = Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### Correlation and covariance

In [5]:
#import pandas.io.data as web
from pandas_datareader import data as web

all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker)

price = DataFrame({tic: data['Adj Close']
                   for tic, data in all_data.iteritems()})
volume = DataFrame({tic: data['Volume']
                    for tic, data in all_data.iteritems()})

In [6]:
all_data

{'AAPL':                   Open        High         Low       Close     Volume  \
 Date
 2010-01-04  213.429998  214.499996  212.380001  214.009998  123432400
 2010-01-05  214.599998  215.589994  213.249994  214.379993  150476200
 2010-01-06  214.379993  215.230000  210.750004  210.969995  138040000
 2010-01-07  211.750000  212.000006  209.050005  210.580000  119282800
 2010-01-08  210.299994  212.000006  209.060005  211.980005  111902700
 2010-01-11  212.799997  213.000002  208.450005  210.110003  115557400
 2010-01-12  209.189995  209.769995  206.419998  207.720001  148614900
 2010-01-13  207.870005  210.929995  204.099998  210.650002  151473000
 2010-01-14  210.110003  210.459997  209.020004  209.430000  108223500
 2010-01-15  210.929995  211.599997  205.869999  205.930000  148516900
 2010-01-19  208.330002  215.189999  207.240004  215.039995  182501900
 2010-01-20  214.910006  215.549994  209.500002  211.730000  153038200
 2010-01-21  212.079994  213.309996  207.210003  208.069996  152038600
 2010-01-22  206.780006  207.499996  197.160000  197.750000  220441900
 2010-01-25  202.510002  204.699999  200.190002  203.070002  266424900
 2010-01-26  205.950001  213.710005  202.580004  205.940001  466777500
 2010-01-27  206.849995  210.580000  199.530001  207.880005  430642100
 2010-01-28  204.930004  205.500004  198.699995  199.289995  293375600
 2010-01-29  201.079996  202.199995  190.250002  192.060003  311488100
 2010-02-01  192.369997  196.000000  191.299999  194.729998  187469100
 2010-02-02  195.909998  196.319994  193.379993  195.859997  174585600
 2010-02-03  195.169994  200.200003  194.420004  199.229994  153832000
 2010-02-04  196.730003  198.370001  191.570005  192.050003  189413000
 2010-02-05  192.630003  196.000000  190.850002  195.460001  212576700
 2010-02-08  195.690006  197.880003  193.999994  194.119997  119567700
 2010-02-09  196.419996  197.499994  194.749998  196.190004  158221700
 2010-02-10  195.889997  196.600000  194.260000  195.120007   92590400
 2010-02-11  194.880001  199.750006  194.059996  198.669994  137586400
 2010-02-12  198.109995  201.639996  195.500002  200.379993  163867200
 2010-02-16  201.940002  203.690002  201.520006  203.399996  135934400
 ...                ...         ...         ...         ...        ...
 2016-05-13   90.000000   91.669998   90.000000   90.519997   44188200
 2016-05-16   92.389999   94.389999   91.650002   93.879997   61140600
 2016-05-17   94.550003   94.699997   93.010002   93.489998   46507400
 2016-05-18   94.160004   95.209999   93.889999   94.559998   41923100
 2016-05-19   94.639999   94.639999   93.570000   94.199997   30342700
 2016-05-20   94.639999   95.430000   94.519997   95.220001   31804600
 2016-05-23   95.870003   97.190002   95.669998   96.430000   37860500
 2016-05-24   97.220001   98.089996   96.839996   97.900002   35036800
 2016-05-25   98.669998   99.739998   98.110001   99.620003   38168800
 2016-05-26   99.680000  100.730003   98.639999  100.410004   56093400
 2016-05-27   99.440002  100.470001   99.250000  100.349998   36229500
 2016-05-31   99.599998  100.400002   98.820000   99.860001   42084800
 2016-06-01   99.019997   99.540001   98.330002   98.459999   29113400
 2016-06-02   97.599998   97.839996   96.629997   97.720001   40004100
 2016-06-03   97.790001   98.269997   97.449997   97.919998   28062900
 2016-06-06   97.989998  101.889999   97.550003   98.629997   23242200
 2016-06-07   99.250000   99.870003   98.959999   99.029999   22366400
 2016-06-08   99.019997   99.559998   98.680000   98.940002   20812700
 2016-06-09   98.500000   99.989998   98.459999   99.650002   26419600
 2016-06-10   98.529999   99.349998   98.480003   98.830002   31462100
 2016-06-13   98.690002   99.120003   97.099998   97.339996   37612900
 2016-06-14   97.320000   98.480003   96.750000   97.459999   31870300
 2016-06-15   97.820000   98.410004   97.029999   97.139999   29254300
 2016-06-16   96.449997   97.750000   96.070000   97.550003   31236300
 2016-06-17   96.620003   96.650002   95.300003   95.330002   60595000
 2016-06-20   96.000000   96.570000   95.029999   95.099998   33942300
 2016-06-21   94.940002   96.349998   94.680000   95.910004   35229500
 2016-06-22   96.250000   96.889999   95.349998   95.550003   28971100
 2016-06-23   95.940002   96.290001   95.250000   96.099998   31863500
 2016-06-24   92.910004   94.660004   92.650002   93.400002   72894000

              Adj Close
 Date
 2010-01-04   28.141855
 2010-01-05   28.190509
 2010-01-06   27.742101
 2010-01-07   27.690818
 2010-01-08   27.874915
 2010-01-11   27.629014
 2010-01-12   27.314734
 2010-01-13   27.700023
 2010-01-14   27.539595
 2010-01-15   27.079353
 2010-01-19   28.277297
 2010-01-20   27.842040
 2010-01-21   27.360757
 2010-01-22   26.003700
 2010-01-25   26.703269
 2010-01-26   27.080668
 2010-01-27   27.335774
 2010-01-28   26.206206
 2010-01-29   25.255478
 2010-02-01   25.606576
 2010-02-02   25.755169
 2010-02-03   26.198316
 2010-02-04   25.254163
 2010-02-05   25.702570
 2010-02-08   25.526363
 2010-02-09   25.798564
 2010-02-10   25.657862
 2010-02-11   26.124677
 2010-02-12   26.349539
 2010-02-16   26.746662
 ...                ...
 2016-05-13   90.519997
 2016-05-16   93.879997
 2016-05-17   93.489998
 2016-05-18   94.559998
 2016-05-19   94.199997
 2016-05-20   95.220001
 2016-05-23   96.430000
 2016-05-24   97.900002
 2016-05-25   99.620003
 2016-05-26  100.410004
 2016-05-27  100.349998
 2016-05-31   99.860001
 2016-06-01   98.459999
 2016-06-02   97.720001
 2016-06-03   97.919998
 2016-06-06   98.629997
 2016-06-07   99.029999
 2016-06-08   98.940002
 2016-06-09   99.650002
 2016-06-10   98.830002
 2016-06-13   97.339996
 2016-06-14   97.459999
 2016-06-15   97.139999
 2016-06-16   97.550003
 2016-06-17   95.330002
 2016-06-20   95.099998
 2016-06-21   95.910004
 2016-06-22   95.550003
 2016-06-23   96.099998
 2016-06-24   93.400002

 [1631 rows x 6 columns],
 'GOOG':                   Open        High         Low       Close    Volume  \
 Date
 2010-01-04  626.951088  629.511067  624.241073  626.751061   3927000
 2010-01-05  627.181073  627.841071  621.541045  623.991055   6031900
 2010-01-06  625.861078  625.861078  606.361042  608.261023   7987100
 2010-01-07  609.401025  610.001045  592.651008  594.101005  12876600
 2010-01-08  592.000997  603.251034  589.110988  602.021036   9483900
 2010-01-11  604.461060  604.461060  594.041028  601.111020  14479800
 2010-01-12  597.651011  598.161034  588.001007  590.481036   9742900
 2010-01-13  576.490965  588.381027  573.900966  587.090991  13041800
 2010-01-14  583.900972  594.200988  582.811024  589.850997   8511900
 2010-01-15  593.341025  593.561024  578.041006  580.000965  10909600
 2010-01-19  581.201005  590.420997  576.290999  587.620986   8665700
 2010-01-20  585.981009  585.981009  575.290986  580.411005   6525700
 2010-01-21  583.441002  586.821000  572.251003  582.980970  12662600
 2010-01-22  564.500980  570.600979  534.860888  550.010933  13651700
 2010-01-25  546.590929  549.880931  535.510900  540.000941   8872800
 2010-01-26  537.970896  549.600954  536.290913  542.420931   8743600
 2010-01-27  541.270944  547.650920  535.310934  542.100949   7958400
 2010-01-28  544.490921  547.000908  530.600893  534.290888   6482300
 2010-01-29  538.490905  540.990906  525.610876  529.940896   8311900
 2010-02-01  534.600945  535.810910  530.300883  533.020884   4518400
 2010-02-02  534.960932  534.960932  527.610902  531.120903   8223000
 2010-02-03  528.670892  542.100949  528.230894  540.820899   6020500
 2010-02-04  537.000902  538.000915  525.560885  526.780897   6780600
 2010-02-05  528.400902  533.500888  522.460925  531.290910   6335600
 2010-02-08  532.500936  542.000905  531.530881  533.470930   5408700
 2010-02-09  539.540909  541.530949  535.070901  536.440949   5660200
 2010-02-10  534.070888  537.790902  527.690913  534.450909   5369000
 2010-02-11  533.320894  540.490931  529.500898  536.400943   4838000
 2010-02-12  532.970893  537.150938  530.500910  533.120928   4576400
 2010-02-16  536.870900  544.130933  534.300935  541.300902   7336100
 ...                ...         ...         ...         ...       ...
 2016-05-13  711.929993  716.661987  709.260010  710.830017   1307300
 2016-05-16  709.130005  718.479980  705.650024  716.489990   1316200
 2016-05-17  715.989990  721.520020  704.109985  706.229980   1999500
 2016-05-18  703.669983  711.599976  700.630005  706.630005   1763400
 2016-05-19  702.359985  706.000000  696.799988  700.320007   1656300
 2016-05-20  701.619995  714.580017  700.520020  709.739990   1816000
 2016-05-23  706.530029  711.478027  704.179993  704.239990   1320900
 2016-05-24  706.859985  720.969971  706.859985  720.090027   1920400
 2016-05-25  720.760010  727.510010  719.705017  725.270020   1629200
 2016-05-26  722.869995  728.330017  720.280029  724.119995   1542900
 2016-05-27  724.010010  733.935974  724.000000  732.659973   1974000
 2016-05-31  731.739990  739.729980  731.260010  735.719971   2119900
 2016-06-01  734.530029  737.210022  730.659973  734.150024   1250800
 2016-06-02  732.500000  733.020020  724.169983  730.400024   1337600
 2016-06-03  729.270020  729.489990  720.559998  722.340027   1222700
 2016-06-06  724.909973  724.909973  714.609985  716.549988   1565300
 2016-06-07  719.840027  721.979980  716.549988  716.650024   1336200
 2016-06-08  723.960022  728.570007  720.580017  728.280029   1582100
 2016-06-09  722.869995  729.539978  722.335999  728.580017    985900
 2016-06-10  719.469971  725.890015  716.429993  719.409973   1206000
 2016-06-13  716.510010  725.440002  716.510010  718.359985   1252800
 2016-06-14  716.479980  722.469971  713.119995  718.270020   1302100
 2016-06-15  719.000000  722.979980  717.309998  718.919983   1208900
 2016-06-16  714.909973  716.650024  703.260010  710.359985   1980200
 2016-06-17  708.650024  708.820007  688.452026  691.719971   3396800
 2016-06-20  698.770020  702.479980  693.409973  693.710022   2071400
 2016-06-21  698.400024  702.770020  692.010010  695.940002   1464300
 2016-06-22  699.059998  700.859985  693.081970  697.460022   1179300
 2016-06-23  697.450012  701.950012  687.000000  701.869995   2157400
 2016-06-24  675.169983  689.400024  673.450012  675.219971   4399800

              Adj Close
 Date
 2010-01-04  313.062468
 2010-01-05  311.683844
 2010-01-06  303.826685
 2010-01-07  296.753749
 2010-01-08  300.709808
 2010-01-11  300.255255
 2010-01-12  294.945572
 2010-01-13  293.252243
 2010-01-14  294.630868
 2010-01-15  289.710772
 2010-01-19  293.516976
 2010-01-20  289.915587
 2010-01-21  291.199286
 2010-01-22  274.730736
 2010-01-25  269.730740
 2010-01-26  270.939526
 2010-01-27  270.779695
 2010-01-28  266.878565
 2010-01-29  264.705742
 2010-02-01  266.244198
 2010-02-02  265.295156
 2010-02-03  270.140309
 2010-02-04  263.127321
 2010-02-05  265.380075
 2010-02-08  266.468996
 2010-02-09  267.952522
 2010-02-10  266.958496
 2010-02-11  267.932539
 2010-02-12  266.294170
 2010-02-16  270.380071
 ...                ...
 2016-05-13  710.830017
 2016-05-16  716.489990
 2016-05-17  706.229980
 2016-05-18  706.630005
 2016-05-19  700.320007
 2016-05-20  709.739990
 2016-05-23  704.239990
 2016-05-24  720.090027
 2016-05-25  725.270020
 2016-05-26  724.119995
 2016-05-27  732.659973
 2016-05-31  735.719971
 2016-06-01  734.150024
 2016-06-02  730.400024
 2016-06-03  722.340027
 2016-06-06  716.549988
 2016-06-07  716.650024
 2016-06-08  728.280029
 2016-06-09  728.580017
 2016-06-10  719.409973
 2016-06-13  718.359985
 2016-06-14  718.270020
 2016-06-15  718.919983
 2016-06-16  710.359985
 2016-06-17  691.719971
 2016-06-20  693.710022
 2016-06-21  695.940002
 2016-06-22  697.460022
 2016-06-23  701.869995
 2016-06-24  675.219971

 [1631 rows x 6 columns],
 'IBM':                   Open        High         Low       Close    Volume  \
 Date
 2010-01-04  131.179993  132.970001  130.850006  132.449997   6155300
 2010-01-05  131.679993  131.850006  130.100006  130.850006   6841400
 2010-01-06  130.679993  131.490005  129.809998  130.000000   5605300
 2010-01-07  129.869995  130.250000  128.910004  129.550003   5840600
 2010-01-08  129.070007  130.919998  129.050003  130.850006   4197200
 2010-01-11  131.059998  131.059998  128.669998  129.479996   5730400
 2010-01-12  129.029999  131.330002  129.000000  130.509995   8081500
 2010-01-13  130.389999  131.119995  129.160004  130.229996   6455400
 2010-01-14  130.550003  132.710007  129.910004  132.309998   7111800
 2010-01-15  132.029999  132.889999  131.089996  131.779999   8494400
 2010-01-19  131.630005  134.250000  131.559998  134.139999  13916200
 2010-01-20  130.460007  131.149994  128.949997  130.250000  15197500
 2010-01-21  130.470001  130.690002  128.059998  129.000000   9608600
 2010-01-22  128.669998  128.889999  125.370003  125.500000  10088600
 2010-01-25  126.330002  126.889999  125.709999  126.120003   5738500
 2010-01-26  125.919998  127.750000  125.410004  125.750000   7135300
 2010-01-27  125.820000  126.959999  125.040001  126.330002   8719200
 2010-01-28  127.029999  127.040001  123.050003  123.750000   9622200
 2010-01-29  124.320000  125.000000  121.900002  122.389999  11571200
 2010-02-01  123.230003  124.949997  122.779999  124.669998   7242900
 2010-02-02  124.790001  125.809998  123.949997  125.529999   5899900
 2010-02-03  125.160004  126.070000  125.070000  125.660004   4177100
 2010-02-04  125.190002  125.440002  122.900002  123.000000   9126900
 2010-02-05  123.040001  123.720001  121.830002  123.519997   8617000
 2010-02-08  123.150002  123.220001  121.739998  121.879997   5718500
 2010-02-09  122.650002  124.199997  122.459999  123.209999   6044500
 2010-02-10  122.940002  123.650002  122.209999  122.809998   5219100
 2010-02-11  122.580002  124.199997  122.059998  123.730003   5089000
 2010-02-12  123.010002  124.050003  121.610001  124.000000   8017700
 2010-02-16  124.910004  125.230003  124.110001  125.230003   6777300
 ...                ...         ...         ...         ...       ...
 2016-05-13  148.789993  149.860001  147.419998  147.720001   2371800
 2016-05-16  147.649994  149.990005  147.440002  149.460007   3052600
 2016-05-17  149.210007  149.500000  147.289993  148.000000   3480300
 2016-05-18  147.990005  148.520004  146.360001  147.339996   2482100
 2016-05-19  146.479996  146.929993  143.960007  144.929993   3615900
 2016-05-20  145.710007  147.509995  145.550003  147.250000   3571400
 2016-05-23  147.610001  147.949997  146.660004  146.770004   2086600
 2016-05-24  146.880005  148.750000  146.880005  148.309998   2824400
 2016-05-25  148.929993  152.089996  148.500000  151.690002   4355300
 2016-05-26  151.550003  152.509995  151.050003  152.440002   3023100
 2016-05-27  152.350006  152.929993  152.149994  152.839996   2422100
 2016-05-31  152.559998  153.809998  152.270004  153.740005   5160800
 2016-06-01  153.000000  153.270004  151.539993  152.509995   2608400
 2016-06-02  152.589996  153.500000  152.119995  153.500000   2635600
 2016-06-03  152.399994  153.039993  151.699997  152.889999   2314800
 2016-06-06  153.089996  153.949997  152.339996  152.729996   2367000
 2016-06-07  153.309998  153.929993  152.660004  153.330002   4452400
 2016-06-08  153.529999  154.089996  153.039993  154.000000   2916400
 2016-06-09  152.919998  153.759995  152.729996  153.419998   2020400
 2016-06-10  152.789993  153.330002  151.860001  152.369995   3094000
 2016-06-13  151.630005  152.500000  150.279999  151.279999   3592200
 2016-06-14  151.279999  151.789993  150.399994  151.059998   2834600
 2016-06-15  151.460007  151.789993  150.600006  150.679993   2167500
 2016-06-16  150.190002  151.289993  149.000000  151.059998   2422400
 2016-06-17  150.960007  152.720001  150.600006  151.990005   4633800
 2016-06-20  152.600006  154.669998  152.520004  153.610001   3478600
 2016-06-21  154.160004  154.570007  153.690002  154.050003   2756400
 2016-06-22  153.750000  154.710007  152.270004  152.919998   2821300
 2016-06-23  153.449997  155.479996  152.600006  155.350006   3911100
 2016-06-24  149.970001  150.610001  146.179993  146.589996   8559400

              Adj Close
 Date
 2010-01-04  114.283108
 2010-01-05  112.902572
 2010-01-06  112.169153
 2010-01-07  111.780878
 2010-01-08  112.902572
 2010-01-11  111.720473
 2010-01-12  112.609197
 2010-01-13  112.367603
 2010-01-14  114.162311
 2010-01-15  113.705007
 2010-01-19  115.741309
 2010-01-20  112.384863
 2010-01-21  111.306313
 2010-01-22  108.286375
 2010-01-25  108.821338
 2010-01-26  108.502085
 2010-01-27  109.002533
 2010-01-28  106.776405
 2010-01-29  105.602943
 2010-02-01  107.570216
 2010-02-02  108.312259
 2010-02-03  108.424432
 2010-02-04  106.129276
 2010-02-05  106.577949
 2010-02-08  105.633248
 2010-02-09  106.785959
 2010-02-10  106.439278
 2010-02-11  107.236646
 2010-02-12  107.470651
 2010-02-16  108.536694
 ...                ...
 2016-05-13  147.720001
 2016-05-16  149.460007
 2016-05-17  148.000000
 2016-05-18  147.339996
 2016-05-19  144.929993
 2016-05-20  147.250000
 2016-05-23  146.770004
 2016-05-24  148.309998
 2016-05-25  151.690002
 2016-05-26  152.440002
 2016-05-27  152.839996
 2016-05-31  153.740005
 2016-06-01  152.509995
 2016-06-02  153.500000
 2016-06-03  152.889999
 2016-06-06  152.729996
 2016-06-07  153.330002
 2016-06-08  154.000000
 2016-06-09  153.419998
 2016-06-10  152.369995
 2016-06-13  151.279999
 2016-06-14  151.059998
 2016-06-15  150.679993
 2016-06-16  151.059998
 2016-06-17  151.990005
 2016-06-20  153.610001
 2016-06-21  154.050003
 2016-06-22  152.919998
 2016-06-23  155.350006
 2016-06-24  146.589996

 [1631 rows x 6 columns],
 'MSFT':                  Open       High        Low      Close     Volume  Adj Close
 Date
 2010-01-04  30.620001  31.100000  30.590000  30.950001   38409100  26.045432
 2010-01-05  30.850000  31.100000  30.639999  30.959999   49749600  26.053846
 2010-01-06  30.879999  31.080000  30.520000  30.770000   58182400  25.893956
 2010-01-07  30.629999  30.700001  30.190001  30.450001   50559700  25.624666
 2010-01-08  30.280001  30.879999  30.240000  30.660000   51197400  25.801387
 2010-01-11  30.709999  30.760000  30.120001  30.270000   68754700  25.473190
 2010-01-12  30.150000  30.400000  29.910000  30.070000   65912100  25.304883
 2010-01-13  30.260000  30.520000  30.010000  30.350000   51863500  25.540513
 2010-01-14  30.309999  31.100000  30.260000  30.959999   63228100  26.053846
 2010-01-15  31.080000  31.240000  30.709999  30.860001   79913200  25.969694
 2010-01-19  30.750000  31.240000  30.680000  31.100000   46575700  26.171662
 2010-01-20  30.809999  30.940001  30.309999  30.590000   54849500  25.742480
 2010-01-21  30.610001  30.719999  30.000000  30.010000   73086700  25.254391
 2010-01-22  30.000000  30.200001  28.840000  28.959999  102004600  24.370781
 2010-01-25  29.240000  29.660000  29.100000  29.320000   63373000  24.673733
 2010-01-26  29.200001  29.850000  29.090000  29.500000   66639900  24.825210
 2010-01-27  29.350000  29.820000  29.020000  29.670000   63949500  24.968270
 2010-01-28  29.840000  29.870001  28.889999  29.160000  117513700  24.539088
 2010-01-29  29.900000  29.920000  27.660000  28.180000  193888500  23.714387
 2010-02-01  28.389999  28.480000  27.920000  28.410000   85931100  23.907939
 2010-02-02  28.370001  28.500000  28.139999  28.459999   54413700  23.950015
 2010-02-03  28.260000  28.790001  28.120001  28.629999   61397900  24.093076
 2010-02-04  28.379999  28.500000  27.809999  27.840000   77850000  23.428266
 2010-02-05  28.000000  28.280001  27.570000  28.020000   80960100  23.579742
 2010-02-08  28.010000  28.080000  27.570000  27.719999   52820600  23.327281
 2010-02-09  27.969999  28.340000  27.750000  28.010000   59195800  23.571326
 2010-02-10  28.030001  28.240000  27.840000  27.990000   48591300  23.554495
 2010-02-11  27.930000  28.400000  27.700001  28.120001   65993700  23.663895

In [54]:
price

,AAPL,GOOG,IBM,MSFT
Date,,,,
2010-01-04,28.141855,313.062468,114.283108,26.045432
2010-01-05,28.190509,311.683844,112.902572,26.053846
2010-01-06,27.742101,303.826685,112.169153,25.893956
2010-01-07,27.690818,296.753749,111.780878,25.624666
2010-01-08,27.874915,300.709808,112.902572,25.801387
2010-01-11,27.629014,300.255255,111.720473,25.473190
2010-01-12,27.314734,294.945572,112.609197,25.304883
2010-01-13,27.700023,293.252243,112.367603,25.540513
2010-01-14,27.539595,294.630868,114.162311,26.053846
2010-01-15,27.079353,289.710772,113.705007,25.969694
2010-01-19,28.277297,293.516976,115.741309,26.171662
2010-01-20,27.842040,289.915587,112.384863,25.742480
2010-01-21,27.360757,291.199286,111.306313,25.254391
2010-01-22,26.003700,274.730736,108.286375,24.370781
2010-01-25,26.703269,269.730740,108.821338,24.673733
2010-01-26,27.080668,270.939526,108.502085,24.825210
2010-01-27,27.335774,270.779695,109.002533,24.968270
2010-01-28,26.206206,266.878565,106.776405,24.539088
2010-01-29,25.255478,264.705742,105.602943,23.714387
2010-02-01,25.606576,266.244198,107.570216,23.907939
2010-02-02,25.755169,265.295156,108.312259,23.950015
2010-02-03,26.198316,270.140309,108.424432,24.093076
2010-02-04,25.254163,263.127321,106.129276,23.428266
2010-02-05,25.702570,265.380075,106.577949,23.579742
2010-02-08,25.526363,266.468996,105.633248,23.327281
2010-02-09,25.798564,267.952522,106.785959,23.571326
2010-02-10,25.657862,266.958496,106.439278,23.554495
2010-02-11,26.124677,267.932539,107.236646,23.663895
2010-02-12,26.349539,266.294170,107.470651,23.504004
2010-02-16,26.746662,270.380071,108.536694,23.969011
...,...,...,...,...
2016-05-13,90.519997,710.830017,147.720001,50.725211
2016-05-16,93.879997,716.489990,149.460007,51.470002
2016-05-17,93.489998,706.229980,148.000000,50.509998
2016-05-18,94.559998,706.630005,147.339996,50.810001
2016-05-19,94.199997,700.320007,144.929993,50.320000
2016-05-20,95.220001,709.739990,147.250000,50.619999
2016-05-23,96.430000,704.239990,146.770004,50.029999
2016-05-24,97.900002,720.090027,148.309998,51.590000
2016-05-25,99.620003,725.270020,151.690002,52.119999
2016-05-26,100.410004,724.119995,152.440002,51.889999
2016-05-27,100.349998,732.659973,152.839996,52.320000
2016-05-31,99.860001,735.719971,153.740005,53.000000
2016-06-01,98.459999,734.150024,152.509995,52.849998
2016-06-02,97.720001,730.400024,153.500000,52.480000
2016-06-03,97.919998,722.340027,152.889999,51.790001
2016-06-06,98.629997,716.549988,152.729996,52.130001
2016-06-07,99.029999,716.650024,153.330002,52.099998
2016-06-08,98.940002,728.280029,154.000000,52.040001
2016-06-09,99.650002,728.580017,153.419998,51.619999
2016-06-10,98.830002,719.409973,152.369995,51.480000
2016-06-13,97.339996,718.359985,151.279999,50.139999
2016-06-14,97.459999,718.270020,151.059998,49.830002
2016-06-15,97.139999,718.919983,150.679993,49.689999
2016-06-16,97.550003,710.359985,151.059998,50.389999
2016-06-17,95.330002,691.719971,151.990005,50.130001
2016-06-20,95.099998,693.710022,153.610001,50.070000
2016-06-21,95.910004,695.940002,154.050003,51.189999
2016-06-22,95.550003,697.460022,152.919998,50.990002
2016-06-23,96.099998,701.869995,155.350006,51.910000
2016-06-24,93.400002,675.219971,146.589996,49.830002

In [55]:
volume

,AAPL,GOOG,IBM,MSFT
Date,,,,
2010-01-04,123432400,3927000,6155300,38409100
2010-01-05,150476200,6031900,6841400,49749600
2010-01-06,138040000,7987100,5605300,58182400
2010-01-07,119282800,12876600,5840600,50559700
2010-01-08,111902700,9483900,4197200,51197400
2010-01-11,115557400,14479800,5730400,68754700
2010-01-12,148614900,9742900,8081500,65912100
2010-01-13,151473000,13041800,6455400,51863500
2010-01-14,108223500,8511900,7111800,63228100
2010-01-15,148516900,10909600,8494400,79913200
2010-01-19,182501900,8665700,13916200,46575700
2010-01-20,153038200,6525700,15197500,54849500
2010-01-21,152038600,12662600,9608600,73086700
2010-01-22,220441900,13651700,10088600,102004600
2010-01-25,266424900,8872800,5738500,63373000
2010-01-26,466777500,8743600,7135300,66639900
2010-01-27,430642100,7958400,8719200,63949500
2010-01-28,293375600,6482300,9622200,117513700
2010-01-29,311488100,8311900,11571200,193888500
2010-02-01,187469100,4518400,7242900,85931100
2010-02-02,174585600,8223000,5899900,54413700
2010-02-03,153832000,6020500,4177100,61397900
2010-02-04,189413000,6780600,9126900,77850000
2010-02-05,212576700,6335600,8617000,80960100
2010-02-08,119567700,5408700,5718500,52820600
2010-02-09,158221700,5660200,6044500,59195800
2010-02-10,92590400,5369000,5219100,48591300
2010-02-11,137586400,4838000,5089000,65993700
2010-02-12,163867200,4576400,8017700,81117200
2010-02-16,135934400,7336100,6777300,51935600
...,...,...,...,...
2016-05-13,44188200,1307300,2371800,22592300
2016-05-16,61140600,1316200,3052600,20032000
2016-05-17,46507400,1999500,3480300,27803500
2016-05-18,41923100,1763400,2482100,24907500
2016-05-19,30342700,1656300,3615900,23842400
2016-05-20,31804600,1816000,3571400,23692400
2016-05-23,37860500,1320900,2086600,25999700
2016-05-24,35036800,1920400,2824400,34621600
2016-05-25,38168800,1629200,4355300,24040200
2016-05-26,56093400,1542900,3023100,24182900
2016-05-27,36229500,1974000,2422100,17653700
2016-05-31,42084800,2119900,5160800,37137700
2016-06-01,29113400,1250800,2608400,24772900
2016-06-02,40004100,1337600,2635600,22565300
2016-06-03,28062900,1222700,2314800,23081300
2016-06-06,23242200,1565300,2367000,18109300
2016-06-07,22366400,1336200,4452400,20794000
2016-06-08,20812700,1582100,2916400,21089400
2016-06-09,26419600,985900,2020400,20203000
2016-06-10,31462100,1206000,3094000,25698900
2016-06-13,37612900,1252800,3592200,82852600
2016-06-14,31870300,1302100,2834600,42159100
2016-06-15,29254300,1208900,2167500,33559600
2016-06-16,31236300,1980200,2422400,31101800
2016-06-17,60595000,3396800,4633800,45670500
2016-06-20,33942300,2071400,3478600,35559500
2016-06-21,35229500,1464300,2756400,33989400
2016-06-22,28971100,1179300,2821300,28713300
2016-06-23,31863500,2157400,3911100,28679600
2016-06-24,72894000,4399800,8559400,125445600

In [9]:
returns = price.pct_change()
returns.tail()

,AAPL,GOOG,IBM,MSFT
Date,,,,
2016-06-20,-0.002413,0.002877,0.010659,-0.001197
2016-06-21,0.008517,0.003215,0.002864,0.022369
2016-06-22,-0.003754,0.002184,-0.007335,-0.003907
2016-06-23,0.005756,0.006323,0.015891,0.018043
2016-06-24,-0.028096,-0.037970,-0.056389,-0.040069

In [10]:
returns.MSFT.corr(returns.IBM)

0.49906764114889607

In [11]:
returns.MSFT.cov(returns.IBM)

9.0493666262209888e-05

In [12]:
returns.corr()

,AAPL,GOOG,IBM,MSFT
AAPL,1.000000,0.408365,0.388986,0.395621
GOOG,0.408365,1.000000,0.404935,0.465652
IBM,0.388986,0.404935,1.000000,0.499068
MSFT,0.395621,0.465652,0.499068,1.000000

In [13]:
returns.cov()

,AAPL,GOOG,IBM,MSFT
AAPL,0.000283,0.000111,0.00008,0.000099
GOOG,0.000111,0.000260,0.00008,0.000111
IBM,0.000080,0.000080,0.00015,0.000090
MSFT,0.000099,0.000111,0.00009,0.000220

In [14]:
returns.corrwith(returns.IBM)

AAPL    0.388986
GOOG    0.404935
IBM     1.000000
MSFT    0.499068
dtype: float64

In [15]:
returns.corrwith(volume)

AAPL   -0.077635
GOOG   -0.004123
IBM    -0.205676
MSFT   -0.099323
dtype: float64

### Unique values, value counts, and membership

In [4]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [5]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [6]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [16]:
sort = uniques.sort()
uniques.sort()

In [11]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [17]:
pd.value_counts(obj.values, sort=False)

a    3
b    2
c    3
d    1
dtype: int64

In [18]:
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [19]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [20]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],
                  'Qu2': [2, 3, 1, 2, 3],
                  'Qu3': [1, 5, 2, 4, 4]})
data

,Qu1,Qu2,Qu3
0,1,2,1
1,3,3,5
2,4,1,2
3,3,2,4
4,4,3,4

In [21]:
result = data.apply(pd.value_counts).fillna(0)
result

,Qu1,Qu2,Qu3
1,1.0,1.0,1.0
2,0.0,2.0,1.0
3,2.0,2.0,0.0
4,2.0,0.0,2.0
5,0.0,0.0,1.0

## Handling missing data

In [26]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [27]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [28]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [29]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [32]:
string_data.fillna('noname')

0       noname
1    artichoke
2       noname
3      avocado
dtype: object

### Filtering out missing data

In [33]:
from numpy import nan as NA
data = Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [34]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [35]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],
                  [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
data

,0,1,2
0,1.0,6.5,3.0
1,1.0,NaN,NaN
2,NaN,NaN,NaN
3,NaN,6.5,3.0

In [36]:
cleaned

,0,1,2
0,1.0,6.5,3.0

In [37]:
data.dropna(how='all')

,0,1,2
0,1.0,6.5,3.0
1,1.0,NaN,NaN
3,NaN,6.5,3.0

In [38]:
data[4] = NA
data

,0,1,2,4
0,1.0,6.5,3.0,NaN
1,1.0,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN
3,NaN,6.5,3.0,NaN

In [39]:
data.dropna(axis=1, how='all')

,0,1,2
0,1.0,6.5,3.0
1,1.0,NaN,NaN
2,NaN,NaN,NaN
3,NaN,6.5,3.0

In [40]:
df = DataFrame(np.random.randn(7, 3))
df

,0,1,2
0,-0.204708,0.478943,-0.519439
1,-0.555730,1.965781,1.393406
2,0.092908,0.281746,0.769023
3,1.246435,1.007189,-1.296221
4,0.274992,0.228913,1.352917
5,0.886429,-2.001637,-0.371843
6,1.669025,-0.438570,-0.539741

In [41]:
df.ix[:4, 1] = NA; df.ix[:2, 2] = NA
df

,0,1,2
0,-0.204708,NaN,NaN
1,-0.555730,NaN,NaN
2,0.092908,NaN,NaN
3,1.246435,NaN,-1.296221
4,0.274992,NaN,1.352917
5,0.886429,-2.001637,-0.371843
6,1.669025,-0.438570,-0.539741

In [42]:
df.dropna(thresh=3)

,0,1,2
5,0.886429,-2.001637,-0.371843
6,1.669025,-0.438570,-0.539741

### Filling in missing data

In [44]:
df.fillna(0)

,0,1,2
0,-0.204708,0.000000,0.000000
1,-0.555730,0.000000,0.000000
2,0.092908,0.000000,0.000000
3,1.246435,0.000000,-1.296221
4,0.274992,0.000000,1.352917
5,0.886429,-2.001637,-0.371843
6,1.669025,-0.438570,-0.539741

In [45]:
df.fillna({1: 0.5, 3: -1})

,0,1,2
0,-0.204708,0.500000,NaN
1,-0.555730,0.500000,NaN
2,0.092908,0.500000,NaN
3,1.246435,0.500000,-1.296221
4,0.274992,0.500000,1.352917
5,0.886429,-2.001637,-0.371843
6,1.669025,-0.438570,-0.539741

In [46]:
# always returns a reference to the filled object
_ = df.fillna(0, inplace=True)
df

,0,1,2
0,-0.204708,0.000000,0.000000
1,-0.555730,0.000000,0.000000
2,0.092908,0.000000,0.000000
3,1.246435,0.000000,-1.296221
4,0.274992,0.000000,1.352917
5,0.886429,-2.001637,-0.371843
6,1.669025,-0.438570,-0.539741

In [47]:
df = DataFrame(np.random.randn(6, 3))
df.ix[2:, 1] = NA; df.ix[4:, 2] = NA
df

,0,1,2
0,0.476985,3.248944,-1.021228
1,-0.577087,0.124121,0.302614
2,0.523772,NaN,1.343810
3,-0.713544,NaN,-2.370232
4,-1.860761,NaN,NaN
5,-1.265934,NaN,NaN

In [48]:
df.fillna(method='ffill')

,0,1,2
0,0.476985,3.248944,-1.021228
1,-0.577087,0.124121,0.302614
2,0.523772,0.124121,1.343810
3,-0.713544,0.124121,-2.370232
4,-1.860761,0.124121,-2.370232
5,-1.265934,0.124121,-2.370232

In [49]:
df.fillna(method='ffill', limit=2)

,0,1,2
0,0.476985,3.248944,-1.021228
1,-0.577087,0.124121,0.302614
2,0.523772,0.124121,1.343810
3,-0.713544,0.124121,-2.370232
4,-1.860761,NaN,-2.370232
5,-1.265934,NaN,-2.370232

In [50]:
data = Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Hierarchical indexing

In [51]:
data = Series(np.random.randn(10),
              index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                     [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
data

a  1    0.332883
   2   -2.359419
   3   -0.199543
b  1   -1.541996
   2   -0.970736
   3   -1.307030
c  1    0.286350
   2    0.377984
d  2   -0.753887
   3    0.331286
dtype: float64

In [52]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [53]:
data['b']

1   -1.541996
2   -0.970736
3   -1.307030
dtype: float64

In [54]:
data['b':'c']

b  1   -1.541996
   2   -0.970736
   3   -1.307030
c  1    0.286350
   2    0.377984
dtype: float64

In [55]:
data.ix[['b', 'd']]

b  1   -1.541996
   2   -0.970736
   3   -1.307030
d  2   -0.753887
   3    0.331286
dtype: float64

In [56]:
data[:, 2]

a   -2.359419
b   -0.970736
c    0.377984
d   -0.753887
dtype: float64

In [57]:
data.unstack()

,1,2,3
a,0.332883,-2.359419,-0.199543
b,-1.541996,-0.970736,-1.307030
c,0.286350,0.377984,NaN
d,NaN,-0.753887,0.331286

In [58]:
data.unstack().stack()

a  1    0.332883
   2   -2.359419
   3   -0.199543
b  1   -1.541996
   2   -0.970736
   3   -1.307030
c  1    0.286350
   2    0.377984
d  2   -0.753887
   3    0.331286
dtype: float64

In [59]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'],
                           ['Green', 'Red', 'Green']])
frame

In [60]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

In [62]:
frame['Ohio']

### Reordering and sorting levels

In [63]:
frame.swaplevel('key1', 'key2')

In [69]:
frame.sortlevel(1)

In [70]:
frame.swaplevel(0, 1).sortlevel(0)

### Summary statistics by level

In [71]:
frame.sum(level='key2')

In [72]:
frame.sum(level='color', axis=1)

### Using a DataFrame's columns

In [73]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),
                   'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                   'd': [0, 1, 2, 0, 1, 2, 3]})
frame

,a,b,c,d
0,0,7,one,0
1,1,6,one,1
2,2,5,one,2
3,3,4,two,0
4,4,3,two,1
5,5,2,two,2
6,6,1,two,3

In [74]:
frame2 = frame.set_index(['c', 'd'])
frame2

In [75]:
frame.set_index(['c', 'd'], drop=False)

In [76]:
frame2.reset_index()

,c,d,a,b
0,one,0,0,7
1,one,1,1,6
2,one,2,2,5
3,two,0,3,4
4,two,1,4,3
5,two,2,5,2
6,two,3,6,1

## Other pandas topics

### Integer indexing

In [78]:
ser = Series(np.arange(3.))
ser.iloc[-1]

2.0

In [81]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [82]:
ser2 = Series(np.arange(3.), index=['a', 'b', 'c'])
ser2[-1]

2.0

In [83]:
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [84]:
ser.ix[:1]

0    0.0
1    1.0
dtype: float64

In [85]:
ser3 = Series(range(3), index=[-5, 1, 3])
ser3.iloc[2]

2

In [86]:
frame = DataFrame(np.arange(6).reshape((3, 2)), index=[2, 0, 1])
frame.iloc[0]

0    0
1    1
Name: 2, dtype: int64

In [87]:
frame

,0,1
2,0,1
0,2,3
1,4,5

### Panel data

In [90]:
import pandas.io.data as web

pdata = pd.Panel(dict((stk, web.get_data_yahoo(stk))
                       for stk in ['AAPL', 'GOOG', 'MSFT', 'DELL']))

In [91]:
pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 1653 (major_axis) x 6 (minor_axis)
Items axis: AAPL to MSFT
Major_axis axis: 2010-01-04 00:00:00 to 2016-06-28 00:00:00
Minor_axis axis: Open to Adj Close

In [92]:
pdata.keys()

Index(['AAPL', 'DELL', 'GOOG', 'MSFT'], dtype='object')

In [93]:
pdata = pdata.swapaxes('items', 'minor')
pdata['Adj Close']

,AAPL,DELL,GOOG,MSFT
Date,,,,
2010-01-04,28.141855,14.06528,313.062468,26.045432
2010-01-05,28.190509,14.38450,311.683844,26.053846
2010-01-06,27.742101,14.10397,303.826685,25.893956
2010-01-07,27.690818,14.23940,296.753749,25.624666
2010-01-08,27.874915,14.36516,300.709808,25.801387
2010-01-11,27.629014,14.37483,300.255255,25.473190
2010-01-12,27.314734,14.56830,294.945572,25.304883
2010-01-13,27.700023,14.57797,293.252243,25.540513
2010-01-14,27.539595,14.22005,294.630868,26.053846
2010-01-15,27.079353,13.92985,289.710772,25.969694
2010-01-19,28.277297,14.32646,293.516976,26.171662
2010-01-20,27.842040,14.03626,289.915587,25.742480
2010-01-21,27.360757,13.92017,291.199286,25.254391
2010-01-22,26.003700,13.18982,274.730736,24.370781
2010-01-25,26.703269,13.43650,269.730740,24.673733
2010-01-26,27.080668,13.13662,270.939526,24.825210
2010-01-27,27.335774,13.08825,270.779695,24.968270
2010-01-28,26.206206,12.84641,266.878565,24.539088
2010-01-29,25.255478,12.47882,264.705742,23.714387
2010-02-01,25.606576,12.78837,266.244198,23.907939
2010-02-02,25.755169,12.86576,265.295156,23.950015
2010-02-03,26.198316,12.92380,270.140309,24.093076
2010-02-04,25.254163,12.58523,263.127321,23.428266
2010-02-05,25.702570,12.80772,265.380075,23.579742
2010-02-08,25.526363,12.95282,266.468996,23.327281
2010-02-09,25.798564,13.10760,267.952522,23.571326
2010-02-10,25.657862,13.30107,266.958496,23.554495
2010-02-11,26.124677,13.49454,267.932539,23.663895
2010-02-12,26.349539,13.38813,266.294170,23.504004
2010-02-16,26.746662,13.67834,270.380071,23.969011
...,...,...,...,...
2016-05-17,93.489998,NaN,706.229980,50.509998
2016-05-18,94.559998,NaN,706.630005,50.810001
2016-05-19,94.199997,NaN,700.320007,50.320000
2016-05-20,95.220001,NaN,709.739990,50.619999
2016-05-23,96.430000,NaN,704.239990,50.029999
2016-05-24,97.900002,NaN,720.090027,51.590000
2016-05-25,99.620003,NaN,725.270020,52.119999
2016-05-26,100.410004,NaN,724.119995,51.889999
2016-05-27,100.349998,NaN,732.659973,52.320000
2016-05-31,99.860001,NaN,735.719971,53.000000
2016-06-01,98.459999,NaN,734.150024,52.849998
2016-06-02,97.720001,NaN,730.400024,52.480000
2016-06-03,97.919998,NaN,722.340027,51.790001
2016-06-06,98.629997,NaN,716.549988,52.130001
2016-06-07,99.029999,NaN,716.650024,52.099998
2016-06-08,98.940002,NaN,728.280029,52.040001
2016-06-09,99.650002,NaN,728.580017,51.619999
2016-06-10,98.830002,NaN,719.409973,51.480000
2016-06-13,97.339996,NaN,718.359985,50.139999
2016-06-14,97.459999,NaN,718.270020,49.830002
2016-06-15,97.139999,NaN,718.919983,49.689999
2016-06-16,97.550003,NaN,710.359985,50.389999
2016-06-17,95.330002,NaN,691.719971,50.130001
2016-06-20,95.099998,NaN,693.710022,50.070000
2016-06-21,95.910004,NaN,695.940002,51.189999
2016-06-22,95.550003,NaN,697.460022,50.990002
2016-06-23,96.099998,NaN,701.869995,51.910000
2016-06-24,93.400002,NaN,675.219971,49.830002
2016-06-27,92.040001,NaN,668.260010,48.430000
2016-06-28,93.589996,NaN,680.039978,49.439999

In [94]:
pdata.ix[:, '6/1/2012', :]

,Open,High,Low,Close,Volume,Adj Close
AAPL,569.159996,572.650009,560.520012,560.989983,130246900.0,73.768977
DELL,12.150000,12.300000,12.045000,12.070000,19397600.0,11.675920
GOOG,571.790972,572.650996,568.350996,570.981000,6138700.0,285.205295
MSFT,28.760000,28.959999,28.440001,28.450001,56634300.0,25.420428

In [97]:
pdata.ix['Adj Close', '5/22/2012', :]

AAPL     73.240361
DELL     14.587650
GOOG    300.100412
MSFT     26.590928
Name: 2012-05-22 00:00:00, dtype: float64

In [99]:
stacked = pdata.ix[:, '5/30/2012':'6/05/2012', :].to_frame()
stacked

In [100]:
stacked.to_panel()

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 5 (major_axis) x 4 (minor_axis)
Items axis: Open to Adj Close
Major_axis axis: 2012-05-30 00:00:00 to 2012-06-05 00:00:00
Minor_axis axis: AAPL to MSFT